--ProtocolProcessorPractice.lua
--@brief	修炼系统相关协议
--@date  	2014/08/25
--@author 	jiaming_liu
--@note 	修炼系统相关协议


ProtocolProcessorPractice = ProtocolProcessorBase:new()


--@brief	注册协议组所有协议
--@note		注册协议组所有协议
function ProtocolProcessorPractice:regAll()
	--服务器到客户端协议注册
	

	--协议错误处理	

end

--@brief	反注册协议组所有协议
--@note		反注册协议组所有协议
function ProtocolProcessorPractice:unregAll()
	self:clearReg()
end

-------------------------------------客户端到服务器协议发送方法模块Begin--------------------------------------



-------------------------------------客户端到服务器协议发送方法模块End--------------------------------------


-------------------------------------服务器到客户端协议回调方法模块Begin--------------------------------------


-------------------------------------服务器到客户端协议回调方法模块End--------------------------------------


-------------------------------------协议错误处理方法模块Begin--------------------------------------


-------------------------------------协议错误处理方法模块End--------------------------------------





